
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Инвентаризация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инвентаризация.Дата КАК Дата,
	|	Инвентаризация.КонецПериода КАК КонецПериода,
	|	Инвентаризация.НачалоПериода КАК НачалоПериода,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	Инвентаризация.Экспонаты.(
	|		НомерСтроки КАК НомерСтроки,
	|		Наименование КАК Наименование,
	|		Идентификатор КАК Идентификатор,
	|		Местоположение КАК Местоположение,
	|		Статус КАК Статус
	|	) КАК Экспонаты,
	|	Инвентаризация.Составитель КАК Составитель
	|ИЗ
	|	Документ.Инвентаризация КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заглавие");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьКомпьютернаяТехникаШапка = Макет.ПолучитьОбласть("КомпьютернаяТехникаШапка");
	ОбластьКомпьютернаяТехника = Макет.ПолучитьОбласть("Экспонаты");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ДатаДок = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Дата = "от " + " """ + День(ДатаДок) + """   " +
		Формат(ДатаДок, "ДФ=ММММ") + "  20" + Формат(ДатаДок,"ДФ=г") + "  г.";
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Пользователь = Выборка.Составитель;
		Шапка.Параметры.НачалоПериода = Формат(Выборка.НачалоПериода, "ДЛФ=Д") + "  по";
		Шапка.Параметры.КонецПериода = Формат(Выборка.КонецПериода, "ДЛФ=Д");
		Шапка.Параметры.ОтветственноеЛицо = "" + Выборка.ОтветственноеЛицо + ".";
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьКомпьютернаяТехникаШапка);
		ВыборкаКомпьютернаяТехника = Выборка.КомпьютернаяТехника.Выбрать();
		Пока ВыборкаКомпьютернаяТехника.Следующий() Цикл
			ОбластьКомпьютернаяТехника.Параметры.Заполнить(ВыборкаКомпьютернаяТехника);
			ТабДок.Вывести(ОбластьКомпьютернаяТехника, ВыборкаКомпьютернаяТехника.Уровень());
		КонецЦикла;
		
		ТабДок.Вывести(Подвал, Выборка.Уровень());
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
