
&НаСервереБезКонтекста
Процедура ПолучатетельПриИзмененииНаСервере(Получатель, ПочтаПолучателя)
		Если Получатель.ПочтовыеЯщики.Количество() > 0 Тогда 
		ПочтаПолучателя = Получатель.ПочтовыеЯщики.Получить(0).Почта;
		    Иначе 
			Сообщить("Ты ошибка");  
			ПочтаПолучателя = "";		
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучатетельПриИзменении(Элемент)
	ПолучатетельПриИзмененииНаСервере(Получатель, ПочтаПолучателя);
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкиПочтыОтправителя");
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере(ПочтаПолучателя, ТекстСообщения);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьНаСервере(ПочтаПолучателя, ТекстСообщения)
	ПочтаОтправителя = Константы.ПочтаОтправителя.Получить();
	ПарольОтправителя = Константы.ПарольПочтыОтправителя.Получить();
	
			Если СтрЗаканчиваетсяНа(ПочтаОтправителя, "@mail.ru") Тогда
				 АдресПочтовогоСервера = "smtp.mail.ru";        
			ИначеЕсли СтрЗаканчиваетсяНа(ПочтаОтправителя, "@yandex.ru") Тогда	
				 АдресПочтовогоСервера = "smtp.yandex.ru";
			 Иначе
				 Сообщить("Используйте mail.ru или yandex.ru");
			 КонецЕсли;    
		 
		 #Область ОтправкаПисьма  
		     Порт = 465;
	ЗаголовокСообщения = "От 1С"; 
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.ИспользоватьSSLSMTP = Истина;
	Профиль.АдресСервераSMTP = АдресПочтовогоСервера; 
	Профиль.ПортSMTP = Порт;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.ПарольSMTP = ПарольОтправителя;
	Профиль.ПользовательSMTP = ПочтаОтправителя; 
	//Профиль.ВремяОжидания = 180;
	//Профиль.Таймаут = 180;
	
	//ПОЧТОВОЕ СООБЩЕНИЕ
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Отправитель = ПочтаОтправителя;
	Сообщение.Тема = ЗаголовокСообщения;
	Сообщение.Тексты.Добавить(ТекстСообщения, ТипТекстаПочтовогоСообщения.HTML);
	Адрес = Сообщение.Получатели.Добавить(ПочтаПолучателя);
	
	Почта = Новый ИнтернетПочта();
	
	//Подключение к серверу
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Сообщить("Ошибка при подключении к серверу: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	//Отправка письма
	Попытка
		Почта.Послать(Сообщение);
	Исключение
		Почта.Отключиться();
		Сообщить("Ошибка при отправке письма: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Почта.Отключиться();
		 #КонецОбласти
	
КонецПроцедуры








