
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// мб что то здесь будет	
КонецПроцедуры 

&НаКлиенте
Процедура ТабДокЭкскурсииЭкскурсияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабДокЭкскурсии.ТекущиеДанные;        
	
	Информация = ПолучитьИнформациюОКТ(СтрокаТабличнойЧасти.Экскурсия);
	СтрокаТабличнойЧасти.ДатаЭкскурсии = Информация[0];
	СтрокаТабличнойЧасти.ВремяНачала = Информация[1];
	СтрокаТабличнойЧасти.ВремяОкончания = Информация[2];

КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюОКТ(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ПланированиеЭкскурсий.ДатаЭкскурсии КАК ДатаЭкскурсии,
	|	ПланированиеЭкскурсий.ВремяНачала КАК ВремяНачала,
	|	ПланированиеЭкскурсий.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	Документ.ПланированиеЭкскурсий КАК ПланированиеЭкскурсий
	|ГДЕ
	|	ПланированиеЭкскурсий.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.ДатаЭкскурсии);
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.ВремяНачала);
		МассивДанных.Добавить(ВыборкаДетальныеЗаписи.ВремяОкончания);
	КонецЦикла; 
	
	Возврат МассивДанных;
КонецФункции

//Форма
&НаКлиенте
Процедура ЦенаБилетаПриИзменении(Элемент)
	Деньги();
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	Деньги();
КонецПроцедуры     

&НаКлиенте
Процедура Деньги()
	Цена = Объект.ЦенаБилета;
	Скидка = Объект.Скидка;

	Итого = Цена - (Цена * (Скидка / 100));
	
	Объект.ИтогоКОплате = Итого;	
КонецПроцедуры

