
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Фамилия)+" "+Лев(Объект.Имя,1)+". "+Лев(Объект.Отчество,1)+".";
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Фамилия)+" "+Лев(Объект.Имя,1)+". "+Лев(Объект.Отчество,1)+".";
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Фамилия)+" "+Лев(Объект.Имя,1)+". "+Лев(Объект.Отчество,1)+".";
КонецПроцедуры

&НаКлиенте
Процедура ВодительскиеПраваПриИзменении(Элемент)        
	Права();  
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	Права();
КонецПроцедуры          

&НаСервере
Процедура Права()
	Если Объект.ВодительскиеПрава = ИСТИНА Тогда
		Элементы.Категорияи.Видимость = ИСТИНА	 
	Иначе  
		Объект.Категорияи = Неопределено; 
		Элементы.Категорияи.Видимость = ЛОЖЬ;      
	КонецЕсли; 	     
КонецПроцедуры



