
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда		
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХранилище));
	КонецЕсли;
	
	ТаблицаТК = ТекущийОбъект.Экспонаты; 
	История = РегистрыСведений.ИсторияПеремещения.СоздатьНаборЗаписей();
	НачатьТранзакцию();
	Для Каждого ТК из ТаблицаТК Цикл
		Если НЕ ТК.ВнесенВБД Тогда
			Запись = Справочники.Экспонаты.СоздатьЭлемент();
			
			Запись.Код = ТК.Идентификатор;  
			Запись.Наименование = ТК.Наименование;
			Запись.Вес = ТК.Вес;
			Запись.ОценочнаяСтоимость = ТК.ОценочнаяСтоимость;
			Запись.Статус = Перечисления.СтатусыЭкспонатов.ВНаличии;
			Запись.Местоположение = Справочники.Залы.Склад;
			Запись.ОтветственноеЛицо = Справочники.Залы.Склад.Заведующий; 
			Запись.ДатаПоступления = ТекущийОбъект.Дата; 
			Запись.Владелец = Справочники.Коллекции.Нейтральная;
			
			Запись.Записать();
			ТК.ВнесенВБД = Истина;
			
			История.Прочитать();
			ЗаписьИстории = История.Добавить();
			ЗаписьИстории.Период = Объект.ДатаИВремяПриемки; //Объект.Дата;
			ЗаписьИстории.Экспонат = Запись.Ссылка;
			ЗаписьИстории.Идентификатор = ТК.Идентификатор; 
			ЗаписьИстории.Откуда = ТекущийОбъект.Организация;
			ЗаписьИстории.Куда = Справочники.Залы.Склад;
			ЗаписьИстории.ОтветственноеЛицо = Справочники.Залы.Склад.Заведующий;
			История.Записать();
			
		КонецЕсли;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

//Файлы
&НаКлиенте
Процедура Загрузить(Команда)   
	Диалог = новый ПараметрыДиалогаПомещенияФайлов("Выберите файл для загрузки");
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДиалога", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, Диалог, УникальныйИдентификатор);   
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалога(ОписаниеФайла, ДопПараметры) Экспорт      
	Попытка
	Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли; 
	
	АдресВХранилище = ОписаниеФайла.Адрес;
	Объект.ИмяФайла = ОписаниеФайла.СсылкаНаФайл.Файл.Имя;
	
	Модифицированность = Истина;
	Исключение        
	    Предупреждение("Форма выбора файла была закрыта. Файл не выбран.");
	КонецПопытки;
КонецПроцедуры 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		УдалитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Скачать(Команда)
	Попытка
		СсылкаНаФайлВИБ = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");
		ПолучитьФайл(СсылкаНаФайлВИБ,Объект.ИмяФайла);
	Исключение
		Предупреждение("Перед тем как скачивать файл, его нужно загрузить! Если же вы попытались открыть или скачать только что загруженый файл, то его перед этим нужно сохранить, нажав кнопку 'Провести и закрыть'.");
	КонецПопытки;
КонецПроцедуры                         

 
