
&НаКлиенте
Процедура БилетыБилетПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Билеты.ТекущиеДанные;
	СтрокаТабличнойЧасти.НомерБилета = ПолучитьНомер(СтрокаТабличнойЧасти.Билет);
КонецПроцедуры         


&НаКлиенте
Процедура ЭкспонатыНаименованиеПриИзменении(Элемент)
	
КонецПроцедуры

Функция ПолучитьНомер(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ПродажаБилетов.НомерБилета КАК НомерБилета
	|ИЗ
	|	Документ.ПродажаБилетов КАК ПродажаБилетов
	|ГДЕ
	|	ПродажаБилетов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.НомерБилета;
	КонецЦикла;
КонецФункции

