
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Картинки
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку); 
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(СсылкаНаКартинку); 
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка");     
	КонецЕсли; 
	Если ПустаяСтрока(СсылкаНаКартинку) Тогда 
        ТекущийОбъект.Картинка=Неопределено;
	КонецЕсли;      
	
	//Перемещение экспонатов 
	История = РегистрыСведений.ИсторияПеремещения.СоздатьНаборЗаписей(); 
	НачатьТранзакцию();
	Для Каждого Актив Из ТекущийОбъект.Экспонаты Цикл
		Экспонаты = Актив.Наименование.ПолучитьОбъект();  
		
		История.Прочитать();
		ЗаписьИстории = История.Добавить();
		ЗаписьИстории.Период = Объект.Дата;
		ЗаписьИстории.Экспонат = Экспонаты.Ссылка;
		ЗаписьИстории.Идентификатор = Экспонаты.Код;
		ЗаписьИстории.Откуда = Экспонаты.Местоположение;     
		
		Экспонаты.Местоположение = Объект.Зал;
		Экспонаты.Записать();
		
		ЗаписьИстории.Куда = Экспонаты.Местоположение;
		ЗаписьИстории.ОтветственноеЛицо = Объект.ОтветственноеЛицо; //Экспонаты.ОтветственноеЛицо;   
		История.Записать();         
		 
	КонецЦикла;  	    
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры 

&НаКлиенте
Процедура ЭкспонатыНаименованиеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Экспонаты.ТекущиеДанные;        
	СтрокаТабличнойЧасти.Идентификатор = ПолучитьИдентификаторТК(СтрокаТабличнойЧасти.Наименование);
КонецПроцедуры

Функция ПолучитьИдентификаторТК(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Экспонаты.Код КАК Код
	|ИЗ
	|	Справочник.Экспонаты КАК Экспонаты
	|ГДЕ
	|	Экспонаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Код;
	КонецЦикла;
КонецФункции  

//Форма
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Календарь = ТекущаяДата();
	Учреждение();
КонецПроцедуры        

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
    Учреждение();
КонецПроцедуры

&НаСервере
Процедура Учреждение()
	Если Объект.Тип = Перечисления.ТипыВыставок.Переданная Тогда
		Элементы.УчреждениеПередавшееВыставку.Видимость = ИСТИНА	
	Иначе                                                        
		Объект.УчреждениеПередавшееВыставку = Неопределено; 
		Элементы.УчреждениеПередавшееВыставку.Видимость = ЛОЖЬ;   
	КонецЕсли; 	     
КонецПроцедуры

//Картинки
&НаКлиенте
Процедура ДобавлениеКартинки(Команда)
	Добавление();	
КонецПроцедуры

&НаКлиенте
Процедура Добавление()
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = ""; 
	Фильтр = "Файлик |*.jpg; *.png; *.jpeg; *.bmp; *.gif";//"Файл Jpg (*.jpg)|*.jpg"; 
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберете файл для загрузки"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт 
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма); 
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); 
КонецПроцедуры  

&НаКлиенте 
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли; 
	СсылкаНаКартинку = Адрес; 
	Модифицированность = Истина; 
КонецПроцедуры
	
&НаКлиенте
Процедура ОчиститьКартинку(Команда)
		СсылкаНаКартинку="" ;
       Модифицированность=Истина;
КонецПроцедуры  
   
&НаСервере        
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка");
КонецПроцедуры                 

