
&НаКлиенте
Процедура Загрузить(Команда)
	Диалог = новый ПараметрыДиалогаПомещенияФайлов("Выберите файл для загрузки");
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДиалога", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, Диалог, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалога(ОписаниеФайла, ДопПараметры) Экспорт
	Попытка
	Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.Наименование = ОписаниеФайла.СсылкаНаФайл.Файл.ИмяБезРасширения;
	Объект.Расширение = ОписаниеФайла.СсылкаНаФайл.Файл.Расширение;
	АдресВХранилище = ОписаниеФайла.Адрес;
	СсылкаНаКартинку = ОписаниеФайла.Адрес;
	
	Модифицированность = Истина;
	Исключение        
	    Предупреждение("Форма выбора файла была закрыта. Файл не выбран.");
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда		
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХранилище));
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		УдалитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку) Тогда
		УдалитьИзВременногоХранилища(СсылкаНаКартинку);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Объект.ЭтоФото Тогда
        СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Скачать(Команда)
	Попытка
		СсылкаНаФайлВИБ = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");
		ПолучитьФайл(СсылкаНаФайлВИБ,Объект.Наименование + Объект.Расширение);
	Исключение
		Предупреждение("Перед тем как скачивать файл, его нужно загрузить! Если же вы попытались открыть или скачать только что загруженый файл, то его перед этим нужно сохранить, нажав кнопку 'Провести и закрыть'.");
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЭтоФотоПриИзменении(Элемент)
	Если Объект.ЭтоФото Тогда
		Элементы.СсылкаНаКартинку.Видимость = Истина;
	Иначе 
		Элементы.СсылкаНаКартинку.Видимость = Ложь;  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ЭтоФото Тогда
		Элементы.СсылкаНаКартинку.Видимость = Истина;
	Иначе 
		Элементы.СсылкаНаКартинку.Видимость = Ложь;  
	КонецЕсли;
КонецПроцедуры
